Revit 2027 API
IFCData.SetSimpleType Method
 Sets the corresponding IFC type by its name.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetSimpleType(
	string typeName
)
Public Sub SetSimpleType (
	typeName As String
)
public:
void SetSimpleType(
	String^ typeName
)
member SetSimpleType :
        typeName : string -> unit
Parameters
typeName String
 The name of the type.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
IFCData Class
Autodesk.Revit.DB.IFC Namespace